Emacs.org
:PROPERTIES:
:HEADER-ARGS:emacs-lisp: :tangle (let ((org-use-tag-inheritance t)) (if (member "INACTIVE" (org-get-tags))  "no" "config/emacs/init.el")))
:END:
#+TITLE: My Emacs Configuration
#+AUTHOR: Lucas Elvira Martín
#+DATE: [2023-12-07 Thu]
#+auto_tangle: t
#+STARTUP: noptag
#+TAGS: INACTIVE(i) TOC(t)

* TOC                                                                   :TOC:
- [[#enable-literature-configuration][Enable literature configuration]]
- [[#lexical-binding][Lexical binding]]
- [[#early-init][Early init]]
  - [[#startup-performance][Startup performance]]
- [[#system-settings][System settings]]
- [[#update-load-path][Update load path]]
- [[#package-system][Package system]]
  - [[#with-straight][With straight]]
- [[#keep-it-clean][Keep it clean]]
- [[#dashboard][Dashboard]]
- [[#general-configuration][General configuration]]
  - [[#standard-settings][Standard settings]]
  - [[#sync-files][Sync files]]
  - [[#highlight-matching-braces][Highlight Matching Braces]]
  - [[#enable-line-numbers][Enable line numbers]]
  - [[#highlight-current-line][Highlight current line]]
- [[#theming][Theming]]
  - [[#reduce-distractions][Reduce distractions]]
  - [[#maximize-windows-by-default-and-setup-transparency][Maximize windows by default and setup transparency]]
  - [[#setup-icons][Setup icons]]
  - [[#color-theme][Color theme]]
  - [[#fonts][Fonts]]
  - [[#modeline][modeline]]
  - [[#anzu-and-vim-anzu][Anzu and vim anzu]]
  - [[#create-frame-hook][create frame hook]]
  - [[#rainbow-delimeters][Rainbow delimeters]]
  - [[#neotree][neotree]]
- [[#keyboard-binding][Keyboard binding]]
  - [[#esc-as-c-g][ESC as C-g]]
  - [[#setup-evil-mode][Setup evil mode]]
  - [[#which-key][Which Key]]
  - [[#custom-shortcut-with-general][Custom shortcut with general]]
- [[#editing-configuration][Editing configuration]]
- [[#work-spaces][Work Spaces]]
- [[#completion-system][Completion system]]
  - [[#company][Company]]
  - [[#cape][Cape]]
  - [[#ivy-and-counsel][ivy and counsel]]
  - [[#vertico-completion-system][Vertico completion system]]
  - [[#completion-in-regions-with-corfu][Completion in Regions with Corfu]]
  - [[#install-smex][Install Smex]]
  - [[#orderless][Orderless]]
  - [[#helpul][helpul]]
  - [[#snippets][Snippets]]
- [[#file-browser-with-dired][File browser with dired]]
- [[#writting][Writting]]
  - [[#flyspell][Flyspell]]
  - [[#visual-fill-configuration][Visual fill configuration]]
  - [[#text-mode][Text mode]]
  - [[#markdown][Markdown]]
  - [[#zen-mode][zen mode]]
- [[#development][Development]]
  - [[#projectile][Projectile]]
  - [[#flycheck][Flycheck]]
  - [[#git][Git]]
  - [[#vterm][vterm]]
  - [[#compilation][Compilation]]
  - [[#language-server-protocol][Language server protocol]]
  - [[#language-support][Language support]]
- [[#org-mode][Org mode]]
  - [[#enable-table-of-content][Enable table of content]]
  - [[#define-all-the-variables][Define all the variables]]
  - [[#gtd][GTD]]
  - [[#configure-babel-languages][Configure Babel languages]]
  - [[#structure-templates][Structure templates]]
  - [[#fonts-and-bullets][Fonts and bullets]]
  - [[#org-templates][Org templates]]
  - [[#close-org-mode-configuration][Close org mode configuration]]
  - [[#pomodoro][Pomodoro]]
  - [[#search-function][Search function]]
  - [[#org-auto-tangle][Org-auto-tangle]]
  - [[#auto-show-markup-symbols][Auto show markup symbols]]
  - [[#org-evil][org evil]]
  - [[#org-ref][Org ref]]
  - [[#org-gnuplot][org gnuplot]]
  - [[#org-wild-notifier][org wild notifier]]
  - [[#org-present][Org present]]
- [[#org-roam][Org roam]]
  - [[#installation][Installation]]
  - [[#configure-org-roam-templates][Configure org roam templates]]
  - [[#zettelkasten][Zettelkasten]]
  - [[#org-roam-ui][Org-roam-ui]]

* Enable literature configuration
:PROPERTIES:
:VISIBILITY: folded
:END:

Emacs allows to export src blocks to a ~.el~ file and load them. This is a great option if you would like to describe each part of the configuation and explain a bit of them. To make them, you need to create a ~init.el~ file with the following code.

*Note* When I move to straight there is a bug with org-mode than generate a conflic with this method. I need to tangle manually all the config to the ~init.el~ file and ~early-iniit.el~ file respectively.

#+begin_example emacs-lisp :tangle no
(org-babel-load-file
(expand-file-name
"config.org"
  user-emacs-directory))
 #+end_example

* Lexical binding
:PROPERTIES:
:VISIBILITY: folded
:END:
Lexical binding is a mode that allows to use special features of the languages. It options tell the configuration that works as a program more than just a simple configuration

This will generate a header at the top of the tangled file to indicate it is generated and is not meant to be modified directly.

#+begin_src emacs-lisp
;;; init.el --- config file -*- lexical-binding: t -*-

;; This file is not part of GNU Emacs

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This file has been generated from config.org file. DO NOT EDIT.
;; Sources are available from https://github.com/luelvira/dotfiles/

;;; Code:
#+end_src

* Early init
:PROPERTIES:
:HEADER-ARGS:emacs-lisp: :tangle config/emacs/early-init.el
:END:

The early-init file is loaded before any process of emacs, either the package system. I use straight as package manager, so I need to disable the default behavior before the ~package.el~ is loaded

#+begin_src emacs-lisp
(defvar private-emacs-directory nil
"The path where the configuration file for emacs are stored.")
(setq package-enable-at-startup nil
      private-emacs-directory user-emacs-directory
    ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
      user-emacs-directory (expand-file-name "~/.cache/emacs/"))
(setq url-history-file (expand-file-name "url/history" user-emacs-directory))
#+end_src

** Startup performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

#+begin_src emacs-lisp
(setq site-run-file nil                         ; No site-wide run-time initializations.
      inhibit-default-init t                    ; No site-wide default library
      gc-cons-threshold (* 50 1000 1000) ; The default is 800 kilobytes. Measured in bytes.
      native-comp-eln-load-path (list (expand-file-name "eln-cache" user-emacs-directory)))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s seconds with %d garbage collections." (emacs-init-time "%.2f") gcs-done)
            (setq gc-cons-threshold (* 8 1024 1024))))
#+end_src

* System settings

This part aims to setting some special configuration based on the system Emacs is running

#+begin_src emacs-lisp
(defconst is-termux
  (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a")))
  "Boolean variable to determinate if Emacs is runing into termux system.")

(defconst is-ubuntu
  (string= (system-name) "HP-Z1-G8")
  "Boolean variable to determinate if Emacs is runing on work's ubutnu machine.")

(defconst is-debian
  (string= (system-name) "debian")
  "Boolean variable to determinate if Emacs is runing on home's debian machine.")

(defconst is-fedora
  (string= (system-name) "fedora-laptop")
  "Boolean variable to determinate if Emacs is runing on laptop's fedora machine.")

(setq user-mail-address (string-trim (shell-command-to-string "git config --global user.email"))
      user-full-name    (string-trim (shell-command-to-string "git config --global user.name")))

(defconst lem/dotfiles (cond ((or is-debian
                                  is-fedora) "~/Documents/git/dotfiles/")
                             (is-termux ".cfg"))
  "The path where the dotfiles git repo is stored.")
#+end_src

* Update load path

Add the lisp script to the path
#+begin_src emacs-lisp
(add-to-list 'load-path (expand-file-name "lisp" private-emacs-directory))
(require 'lem_conf)
#+end_src

* Package system

** With straight

Using [[https://github.com/radian-software/straight.el][straight]] for package management and disable checking (for speedup).

#+begin_src emacs-lisp
(setq straight-check-for-modifications nil)
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Use straight by default
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
(provide 'straight-setup)
#+end_src

* Keep it clean

First I define the default emacs back-up where all the cache files will be stored. I set the emacs directory in early-init to prevent emacs install staffs inside the config folder. Use no-littering to automatically set common paths to the new user-emacs-directory

#+begin_src emacs-lisp
(use-package no-littering)
#+end_src

Then define where will be store the temporal files

#+begin_src emacs-lisp
(setq backup-directory-alist `(("." . ,(expand-file-name "backup" user-emacs-directory)))
      backup-by-copying      t   ; instead of renaming current file (clobbers links)
      create-lockfiles       nil
      make-backup-files      t   ; Backup of a file the first time it is saved.
      backup-by-copying      t   ; Don't delink hardlinks
      version-control        t   ; Use version numbers on backups
      delete-old-versions    t   ; Automatically delete excess backups
      kept-new-versions      6   ; how many of the newest versions to keep
      kept-old-versions      5   ; and how many of the old
      auto-save-default      t
      ;; Don't auto-disable auto-save after deleting big chunks. This defeats
      ;; the purpose of a failsafe. This adds the risk of losing the data we
      ;; just deleted, but I believe that's VCS's jurisdiction, not ours.
      auto-save-include-big-deletions t
      require-final-newline           t)
#+end_src

Also I will change the location of the ~custom-file.el~, setting it in the config folder

#+begin_src emacs-lisp
(use-package cus-edit
  :straight nil
  :custom (custom-file (expand-file-name "custom.el" private-emacs-directory))
  :config
  (when (file-exists-p custom-file)
    (load custom-file 'noerror 'nomessage)))
#+end_src

*** Emacs as server

This command allow to run emacs as server, so all the startup can be done once time and connect client to it each time you need.

#+begin_src emacs-lisp
(require 'server)
(unless (or is-termux
            (server-running-p))
  (server-start))
#+end_src

*** Auto revert buffers
#+begin_src emacs-lisp
;; Autorevert buffers
;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)
;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)
#+end_src

* Dashboard

Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.

#+begin_src emacs-lisp
(use-package dashboard
  :demand
  :diminish (dashboard-mode)
  :init      ;; tweak dashboard config before loading it
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  (setq dashboard-banner-logo-title "Close the world. Open the nExt.")
  (setq dashboard-set-navigator t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  ;(setq dashboard-startup-banner 3)
  (setq dashboard-center-content t)
  (setq dashboard-items '((recents   . 5)
                          (agenda    . 5 )
                          (projects  . 3)))
  (setq dashboard-set-navigator t)
  (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
  (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
  :config
  (dashboard-setup-startup-hook)
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))
#+end_src

* General configuration

** Standard settings

This section  contains a list of common and simple configuration

*** Startup screen

#+begin_src emacs-lisp
(setq inhibit-startup-screen t
      inhibit-startup-echo-area-message user-full-name)
#+end_src

*** Default encoding

#+begin_src emacs-lisp
;; Set encding by default
(set-default-coding-systems 'utf-8)     ; Default to utf-8 encoding
(prefer-coding-system       'utf-8)     ; Add utf-8 at the front for automatic detection.
(set-terminal-coding-system 'utf-8)     ; Set coding system of terminal output
(set-keyboard-coding-system 'utf-8)     ; Set coding system for keyboard input on TERMINAL
(set-language-environment "English")    ; Set up multilingual environment
#+end_src

*** Disable warnings
#+begin_src emacs-lisp
;; Disable warnings
(setq native-comp-async-report-warnings-errors nil)
#+end_src

*** Recovery

If Emacs or the computer crashes, you can recover the files you were editing at the time of the crash from their auto-save files. To do this, start Emacs again and type the command M-x recover-session. Here, we parameterize how files are saved in the background.

#+begin_src emacs-lisp
(setq auto-save-list-file-prefix ; Prefix for generating auto-save-list-file-name
      (expand-file-name ".auto-save-list/.saves-" user-emacs-directory)
      auto-save-default t        ; Auto-save every buffer that visits a file
      auto-save-timeout 20       ; Number of seconds between auto-save
      auto-save-interval 200)    ; Number of keystrokes between auto-saves

#+end_src

